pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>BLEIF</name>
      <version>1.0</version>
      <description>BLE Interface</description>
      <!-- <groupName>GROUP_BLEIF</groupName> -->
      <baseAddress>0x5000C000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000414</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BLE</name>
        <description>BLE_IRQ</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFO</name>
          <description>Provides direct random access to both input and output FIFOs. The state of the FIFO is not disturbed by reading these locations (i.e., no POP will occur). FIFO0 is accessible from addresses 0x0 - 0x1C, and is used for data output from the IOM to external devices. These FIFO locations can be read and written directly.
FIFO locations 0x20 - 0x3C provide read only access to the input FIFO. These FIFO locations cannot be directly written by the MCU, and are updated only by the internal hardware. Writes to the FIFO0 will take effect immediately. The currently FIFO pointers
in register FIFOLOC indicate the current offset into each FIFO0 for the read and write operations.
Access to the FIFOs can only be done in word increments; Byte access and writes are not supported.
For push and pop style access to FIFO0 can be done using the FIFOPOP and FIFOPUSH registers below.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>FIFO direct access. Only locations 0 - 3F will return valid information.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPTR</name>
          <description>Provides the current valid byte count of data within the FIFO as seen from the internal state machines. FIFO0 is dedicated to outgoing transactions and FIFO1 is dedicated to incoming transactions. All counts are specified in units of bytes.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO1REM</name>
              <description>The number of remaining data bytes slots currently in FIFO 1 (written by interface, read by MCU)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFO1SIZ</name>
              <description>The number of valid data bytes currently in FIFO 1 (written by interface, read by MCU)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFO0REM</name>
              <description>The number of remaining data bytes slots currently in FIFO 0 (written by MCU, read by interface)</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFO0SIZ</name>
              <description>The number of valid data bytes currently in the FIFO 0 (written by MCU, read by interface)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTHR</name>
          <description>Sets the threshold values for incoming and outgoing transactions. The threshold values are used to assert the interrupt if enabled, and also used during DMA to set the transfer size as a result of DMATHR trigger.
The WTHR is used to indicate when there are more than WTHR bytes of open FIFO locations available in the outgoing FIFO (FIFO0). The intended use to invoke an interrupt or DMA transfer that will refill the FIFO with a byte count up to this value.
The RTHR is used to indicate when there are more than RTHR bytes in the incoming FIFO (FIFO1) and a data transfer of this size can be supported, either through direct POP of the FIFO, or through DMA.
The value of both RTHR and WTHR are also used to set the data transfer size of DMA operations if DMATHR trigger is enabled.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003F3F</resetMask>

          <fields>
            <field>
              <name>FIFOWTHR</name>
              <description>FIFO write threshold in bytes. A value of 0 will disable the write FIFO level from activating the threshold interrupt. If this field is non-zero, it will trigger a threshold interrupt when the write FIFO contains FIFOWTHR free bytes, as indicated by the FIFO0REM field. This is intended to signal when a transfer of FIFOWTHR bytes can be done from the host to the IOM write FIFO to support large IOM write operations.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFORTHR</name>
              <description>FIFO read threshold in bytes. A value of 0 will disable the read FIFO level from activating the threshold interrupt. If this field is non-zero, it will trigger a threshold interrupt when the read FIFO contains FIFORTHR valid bytes of data, as indicated by the FIFO1SIZ field. This is intended to signal when a data transfer of FIFORTHR bytes can be done from the IOM module to the host via the read FIFO to support large IOM read operations.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

