pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>SPHA</name>
              <description>Selects the SPI phase; When 1, will shift the sampling edge by 1/2 clock.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_LEADING_EDGE</name>
                  <description>Sample on the leading (first) clock edge, rising or falling dependent on the value of SPOL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_TRAILING_EDGE</name>
                  <description>Sample on the trailing (second) clock edge, rising of falling dependent on the value of SPOL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPOL</name>
              <description>This bit selects SPI polarity.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_BASE_0</name>
                  <description>The initial value of the clock is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_BASE_1</name>
                  <description>The initial value of the clock is 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLECFG</name>
          <description>Provides control of isolation and IO signals between the interface module and the BLE Core.</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>SPIISOCTL</name>
              <description>Configuration of BLEH isolation controls for SPI related signals.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>SPI signals from BLE Core to/from MCU Core are isolated.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>SPI signals from BLE Core to/from MCU Core are not isolated.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>SPI signals from BLE Core to/from MCU Core are automatically isolated by the logic</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRISOCTL</name>
              <description>Configuration of BLEH isolation control for power related signals.</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>BLEH power signal isolation to on (isolated).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>BLEH power signal isolation to off (not isolated).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>BLEH Power signal isolation is controlled automatically through the interface logic</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STAYASLEEP</name>
              <description>Set to prevent the BLE power control module from waking up the BLE Core after going into power down. To be used for graceful shutdown, set by software prior to powering off and will allow assertion of reset from sleep state.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FRCCLK</name>
              <description>Force the clock in the BLEIF to be always running</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUFRCSLP</name>
              <description>Force power state machine to go to the sleep state. Intended for debug only. Has no effect on the actual BLE Core state, only the state of the BLEIF interface state machine.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WT4ACTOFF</name>
              <description>Debug control of BLEIF power state machine. Allows transition into the active state in the BLEIF state without waiting for DCDC request from BLE Core.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLEHREQCTL</name>
              <description>BLEH power on request override. The value of this field will be sent to the BLE Core when the PWRSM is off. Otherwise, the value is supplied from internal logic.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>BLEH Power-on reg signal is set to on (1).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>BLEH Power-on signal is set to off (0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>BLEH Power-on signal is controlled by the PWRSM logic and automatically controlled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDCFLGCTL</name>
              <description>DCDCFLG signal override. The value of this field will be sent to the BLE Core when the PWRSM is off. Otherwise, the value is supplied from internal logic.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>DCDC Flag signal is set to on (1).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>DCDC Flag signal is set to off (0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>DCDC Flag signal is controlled by the PWRSM logic and automatically controlled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUPCTL</name>
              <description>WAKE signal override. Controls the source of the WAKE signal to the BLE Core.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Wake signal is set to on (1).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Wake signal is set to off (0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Wake signal is controlled by the PWRSM logic and automatically controlled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLERSTN</name>
              <description>Reset line to the BLE Core. This will reset the BLE core when asserted ('0') and must be written to '1' prior to performing any BTLE related operations to the core.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>The reset signal is active (0)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>The reset signal is inactive (1)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSMEN</name>
              <description>Enable the power state machine for automatic sequencing and control of power states of the BLE Core module.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Internal power state machine is enabled and will sequence the BLEH power domain as indicated in the design document. Overrides for the power signals are not enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Internal power state machine is disabled and will not sequence the BLEH power domain. The values of the overrides will be used to drive the output sequencing signals</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCMD</name>
          <description>Sends power related commands to the power state machine in the BLE IF module.</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>RESTART</name>
              <description>Restart the BLE Core after going into the shutdown state. Only valid when in the shutdown state.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

