pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>WAKEREQ</name>
              <description>Wake request from the MCU. When asserted (1), the BLE Interface logic will assert the wakeup request signal to the BLE Core. Only recognized when in the sleep state</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BSTATUS</name>
          <description>Status of the BLE Core interface signals</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>BLEHREQ</name>
              <description>Value of the BLEHREQ signal to the power control unit. The BLEHREQ signal is sent from the BLEIF module to the power control module to request the BLEH power up. When the BLEHACK signal is asserted,
BLEH power is stable and ready for use.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLEHACK</name>
              <description>Value of the BLEHACK signal from the power control unit. If the signal is '1', the BLEH power is active and ready for use.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRST</name>
              <description>Current status of the power state machine</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Internal power state machine is disabled and will not sequence the BLEH power domain. The values of the overrides will be used to drive the output sequencing signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT</name>
                  <description>Initialization state. BLEH not powered</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRON</name>
                  <description>Waiting for the power-up of the BLEH</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>The BLE Core is powered and active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>The BLE Core has entered sleep mode and the power request is inactive</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>The BLE Core is in shutdown mode</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLEIRQ</name>
              <description>Status of the BLEIRQ signal from the BLE Core. A value of 1 indicates that read data is available in the core and a read operation needs to be performed.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WAKEUP</name>
              <description>Value of the WAKEUP signal to the BLE Core . The WAKEUP signals is sent from the BLEIF to the BLECORE to request the BLE Core transition from sleep state to active state.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDCFLAG</name>
              <description>Value of the DCDCFLAG signal to the BLE Core. The DCDCFLAG is a signal to the BLE Core indicating that the BLEH power is active.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDCREQ</name>
              <description>Value of the DCDCREQ signal from the BLE Core. The DCDCREQ signal is sent from the core to the BLEIF module when the BLE core requires BLEH power to be active. When activated, this is
indicated by DCDCFLAG going to 1.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPISTATUS</name>
              <description>Value of the SPISTATUS signal from the BLE Core. The signal is asserted when the BLE Core is able to accept write data via the SPI interface. Data should be transmitted to the
BLE core only when this signal is 1. The hardware will automatically wait for this signal prior to performing a write operation if flow control is active.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>B2MSTATE</name>
              <description>State of the BLE Core logic.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset State</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sleep</name>
                  <description>Sleep state.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Standby</name>
                  <description>Standby State</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Idle state</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Active state.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEDBG</name>
          <description>Debug control</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DBGDATA</name>
              <description>Debug data</description>
              <bitRange>[31:3]</bitRange>
              <access>read-write</access>

