pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>NCR0END</name>
          <description>FLASH Cache Noncacheable Region 0 End</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>End address for non-cacheable region 0</description>
              <bitRange>[26:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR1START</name>
          <description>FLASH Cache Noncacheable Region 1 Start</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Start address for non-cacheable region 1</description>
              <bitRange>[26:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR1END</name>
          <description>FLASH Cache Noncacheable Region 1 End</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>End address for non-cacheable region 1</description>
              <bitRange>[26:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMON0</name>
          <description>Data Cache Total Accesses</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DACCESS_COUNT</name>
              <description>Total accesses to data cache. All performance metrics should be relative to the number of accesses performed.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMON1</name>
          <description>Data Cache Tag Lookups</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DLOOKUP_COUNT</name>
              <description>Total tag lookups from data cache.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMON2</name>
          <description>Data Cache Hits</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DHIT_COUNT</name>
              <description>Cache hits from lookup operations.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMON3</name>
          <description>Data Cache Line Hits</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DLINE_COUNT</name>
              <description>Cache hits from line cache</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IMON0</name>
          <description>Instruction Cache Total Accesses</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IACCESS_COUNT</name>
              <description>Total accesses to Instruction cache</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IMON1</name>
          <description>Instruction Cache Tag Lookups</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ILOOKUP_COUNT</name>
              <description>Total tag lookups from Instruction cache</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IMON2</name>
          <description>Instruction Cache Hits</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IHIT_COUNT</name>
              <description>Cache hits from lookup operations</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

