pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>SEDELAY2</name>
              <description>Sets SE delay (FLASH address setup). A value of 5 is recommended.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RDWAIT2</name>
              <description>Sets read wait states for normal (fast) operation. A value of 1 is recommended.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASH3CFG</name>
          <description>FLASH 3 Control</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000873</resetValue>
          <resetMask>0x00003F7F</resetMask>

          <fields>
            <field>
              <name>LPMMODE3</name>
              <description>Controls FLASH low power modes (control of LPM pin).</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>High power mode (LPM not used).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>Fast Standby mode. LPM deasserted for read operations, but asserted while FLASH IDLE.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Low Power mode. LPM always asserted for reads. LPM_RD_WAIT must be programmed to accommodate longer read access times.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMRDWAIT3</name>
              <description>Sets FLASH wait states when in LPM Mode 2 (RD_WAIT in LPM mode 2 only)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SEDELAY3</name>
              <description>Sets SE delay (FLASH address setup). A value of 5 is recommended.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RDWAIT3</name>
              <description>Sets read wait states for normal (fast) operation. A value of 1 is recommended.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>CLKGEN</name>
      <version>1.0</version>
      <description>Clock Generator</description>
      <!-- <groupName>GROUP_CLKGEN</groupName> -->
      <baseAddress>0x40004000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000110</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CLKGEN</name>
        <description>CLKGEN_IRQ</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CALXT</name>
          <description>This is the XT Oscillator Calibration value. This value allows any derived XT clocks to be calibrated. This means that the original 32KHz version of XT will not be changed, but a 16KHz version (divided down version) can be modified. This register value will add or subtract the number of cycles programmed in this register across a 32 seconds interval. For example, if a value of 100 is programmed in this register, then 100 additional clock cycles will be added into a 16KHz clock period across a 32 second interval.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>CALXT</name>
              <description>XT Oscillator calibration value. This register will enable the hardware to increase or decrease the number of cycles in a 16KHz clock derived from the original 32KHz version. The most significant bit is the sign. A '1' is a reduction, and a '0' is an addition. This calibration value will add or reduce the number of cycles programmed here across a 32 second interval. The maximum value that is effective is from -1024 to 1023.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CALRC</name>
          <description>This is the LFRC Calibration value. Similar to the XT calibration, it allows the derived LFRC clock to be calibrated. The original 1024Hz clock source will not change, but a 512Hz version (divided down version) can be modified. This register will add or subtract the number of cycles programmed in this register across a 1024 seconds interval. For example, if a value of 200 is programmed in this register, then 200 additional clocks will be added into the 512Hz derived clock across a 1024 seconds interval.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>CALRC</name>
              <description>LFRC Oscillator calibration value. This register will enable the hardware to increase or decrease the number of cycles in a 512 Hz clock derived from the original 1024 version. The most significant bit is the sign. A '1' is a reduction, and a '0' is an addition. This calibration value will add or reduce the number of cycles programmed here across a 32 second interval. The range is from -131072 (decimal) to 131071 (decimal). This register is normally used in conjunction with ACALCTR register. The CALRC register will load the ACALCTR register (bits 17:0) if the ACALCTR register is set to measure the LFRC with the XT clock.</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

