pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>CMPR2A3</name>
              <description>Counter/Timer A3 Compare Register 2. Holds the lower limit for timer half A.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMPRAUXB3</name>
          <description>Enhanced compare limits for timer half B.</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CMPR3B3</name>
              <description>Counter/Timer B3 Compare Register 3. Holds the upper limit for timer half B.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMPR2B3</name>
              <description>Counter/Timer B3 Compare Register 2. Holds the lower limit for timer half B.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AUX3</name>
          <description>Control bit fields for both halves of timer 0.</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FBF7FFF</resetMask>

          <fields>
            <field>
              <name>TMRB3EN23</name>
              <description>Counter/Timer B3 Upper compare enable.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable enhanced functions.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable enhanced functions.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB3POL23</name>
              <description>Upper output polarity</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORM</name>
                  <description>Upper output normal polarity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Upper output inverted polarity.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB3TINV</name>
              <description>Counter/Timer B3 Invert on trigger.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable invert on trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable invert on trigger</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB3NOSYNC</name>
              <description>Source clock synchronization control.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Synchronization on source clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOSYNC</name>
                  <description>No synchronization on source clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB3TRIG</name>
              <description>Counter/Timer B3 Trigger Select.</description>
              <bitRange>[26:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Trigger source is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3OUT</name>
                  <description>Trigger source is CTIMERA3 OUT.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT</name>
                  <description>Trigger source is CTIMERB2 OUT.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2OUT</name>
                  <description>Trigger source is CTIMERA2 OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4OUT</name>
                  <description>Trigger source is CTIMERA4 OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT</name>
                  <description>Trigger source is CTIMERB4 OUT.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT</name>
                  <description>Trigger source is CTIMERA6 OUT.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B6OUT</name>
                  <description>Trigger source is CTIMERB6 OUT.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B5OUT2</name>
                  <description>Trigger source is CTIMERB5 OUT2.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5OUT2</name>
                  <description>Trigger source is CTIMERA5 OUT2.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT2</name>
                  <description>Trigger source is CTIMERA1 OUT2.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1OUT2</name>
                  <description>Trigger source is CTIMERB1 OUT2.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2DUAL</name>
                  <description>Trigger source is CTIMERA6 OUT2, dual edge.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7OUT2DUAL</name>
                  <description>Trigger source is CTIMERA7 OUT2, dual edge.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT2DUAL</name>
                  <description>Trigger source is CTIMERB2 OUT2, dual edge.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2OUT2DUAL</name>
                  <description>Trigger source is CTIMERA2 OUT2, dual edge.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB3LMT</name>
              <description>Counter/Timer B3 Pattern Limit Count.</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>

