pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
          <fields>
            <field>
              <name>CFGB7</name>
              <description>CTIMER B7 input configuration</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT31</name>
                  <description>Input is CT31</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT30</name>
                  <description>Input is CT30</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGA7</name>
              <description>CTIMER A7 input configuration</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT29</name>
                  <description>Input is CT29</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT28</name>
                  <description>Input is CT28</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGB6</name>
              <description>CTIMER B6 input configuration</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT27</name>
                  <description>Input is CT27</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT26</name>
                  <description>Input is CT26</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGA6</name>
              <description>CTIMER A6 input configuration</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT25</name>
                  <description>Input is CT25</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT24</name>
                  <description>Input is CT24</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGB5</name>
              <description>CTIMER B5 input configuration</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT23</name>
                  <description>Input is CT23</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT22</name>
                  <description>Input is CT22</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGA5</name>
              <description>CTIMER A5 input configuration</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT21</name>
                  <description>Input is CT21</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT20</name>
                  <description>Input is CT20</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGB4</name>
              <description>CTIMER B4 input configuration</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT19</name>
                  <description>Input is CT19</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT18</name>
                  <description>Input is CT18</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGA4</name>
              <description>CTIMER A4 input configuration</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT17</name>
                  <description>Input is CT17</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16</name>
                  <description>Input is CT16</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGB3</name>
              <description>CTIMER B3 input configuration</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT15</name>
                  <description>Input is CT15</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT14</name>
                  <description>Input is CT14</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGA3</name>
              <description>CTIMER A3 input configuration</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT13</name>
                  <description>Input is CT13</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT12</name>
                  <description>Input is CT12</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGB2</name>
              <description>CTIMER B2 input configuration</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT11</name>
                  <description>Input is CT11</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT10</name>
                  <description>Input is CT10</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGA2</name>
              <description>CTIMER A2 input configuration</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT9</name>
                  <description>Input is CT9</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT8</name>
                  <description>Input is CT8</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGB1</name>
              <description>CTIMER B1 input configuration</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT7</name>
                  <description>Input is CT7</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT6</name>
                  <description>Input is CT6</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGA1</name>
              <description>CTIMER A1 input configuration</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT5</name>
                  <description>Input is CT5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT4</name>
                  <description>Input is CT4</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGB0</name>
              <description>CTIMER B0 input configuration</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT3</name>
                  <description>Input is CT3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT2</name>
                  <description>Input is CT2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFGA0</name>
              <description>CTIMER A0 input configuration</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT1</name>
                  <description>Input is CT1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT0</name>
                  <description>Input is CT0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STCFG</name>
          <description>The STIMER Configuration Register contains the software control for selecting the clock divider and source feeding the system timer.</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xC000FF0F</resetMask>

          <fields>
            <field>
              <name>FREEZE</name>
              <description>Set this bit to one to freeze the clock input to the COUNTER register. Once frozen, the value can be safely written from the MCU. Unfreeze to resume.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THAW</name>
                  <description>Let the COUNTER register run on its input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Stop the COUNTER register for loading.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLEAR</name>
              <description>Set this bit to one to clear the System Timer register. If this bit is set to '1', the system timer register will stay cleared. It needs to be set to '0' for the system timer to start running.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Let the COUNTER register run on its input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Stop the COUNTER register for loading.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE_H_EN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparison is met.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare H disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare H enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE_G_EN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparison is met.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare G disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare G enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE_F_EN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparison is met.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare F disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare F enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE_E_EN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparison is met.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare E disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare E enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE_D_EN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparison is met.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare D disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare D enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE_C_EN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparison is met.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare C disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare C enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE_B_EN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparison is met.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare B disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare B enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARE_A_EN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparison is met.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare A disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare A enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Selects an appropriate clock source and divider to use for the System Timer clock.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLK</name>
                  <description>No clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>3MHz from the HFRC clock divider.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV256</name>
                  <description>187.5KHz from the HFRC clock divider.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_DIV1</name>
                  <description>32768Hz from the crystal oscillator.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_DIV2</name>
                  <description>16384Hz from the crystal oscillator.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_DIV32</name>
                  <description>1024Hz from the crystal oscillator.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV1</name>
                  <description>Approximately 1KHz from the LFRC oscillator (uncalibrated).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0A</name>
                  <description>Use CTIMER 0 section A as a prescaler for the clock source.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0B</name>
                  <description>Use CTIMER 0 section B (or A and B linked together) as a prescaler for the clock source.</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STTMR</name>
          <description>The COUNTER Register contains the running count of time as maintained by incrementing for every rising clock edge of the clock source selected in the configuration register. It is this counter value that captured in the capture registers and it is this counter value that is compared against the various compare registers. This register cannot be written, but can be cleared to 0 for a deterministic value. Use the FREEZE bit will stop this counter from incrementing.</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>STTMR</name>
              <description>Value of the 32-bit counter as it ticks over.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

