pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SNVR2</name>
          <description>The NVRAM_C Register contains a portion of the stored epoch offset associated with the time in the COUNTER register. This register is only reset by POI not by HRESETn. Its contents are intended to survive all reset level except POI and full power cycles.</description>
          <addressOffset>0x000001F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SNVR2</name>
              <description>Value of the 32-bit counter as it ticks over.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SNVR3</name>
          <description>The NVRAM_D Register contains a portion of the stored epoch offset associated with the time in the COUNTER register. This register is only reset by POI not by HRESETn. Its contents are intended to survive all reset level except POI and full power cycles.</description>
          <addressOffset>0x000001FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SNVR3</name>
              <description>Value of the 32-bit counter as it ticks over.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CTMRB7C1INT</name>
              <description>Counter/Timer B7 interrupt based on COMPR1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA7C1INT</name>
              <description>Counter/Timer A7 interrupt based on COMPR1.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB6C1INT</name>
              <description>Counter/Timer B6 interrupt based on COMPR1.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA6C1INT</name>
              <description>Counter/Timer A6 interrupt based on COMPR1.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB5C1INT</name>
              <description>Counter/Timer B5 interrupt based on COMPR1.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA5C1INT</name>
              <description>Counter/Timer A5 interrupt based on COMPR1.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB4C1INT</name>
              <description>Counter/Timer B4 interrupt based on COMPR1.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA4C1INT</name>
              <description>Counter/Timer A4 interrupt based on COMPR1.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB3C1INT</name>
              <description>Counter/Timer B3 interrupt based on COMPR1.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3C1INT</name>
              <description>Counter/Timer A3 interrupt based on COMPR1.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2C1INT</name>
              <description>Counter/Timer B2 interrupt based on COMPR1.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2C1INT</name>
              <description>Counter/Timer A2 interrupt based on COMPR1.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1C1INT</name>
              <description>Counter/Timer B1 interrupt based on COMPR1.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1C1INT</name>
              <description>Counter/Timer A1 interrupt based on COMPR1.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0C1INT</name>
              <description>Counter/Timer B0 interrupt based on COMPR1.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0C1INT</name>
              <description>Counter/Timer A0 interrupt based on COMPR1.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

