pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
          <fields>
            <field>
              <name>PAD35FNCSEL</name>
              <description>Pad 35 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE7</name>
                  <description>Configure as the analog input for ADC single ended input 7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE35</name>
                  <description>IOM/MSPI nCE group 35</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as the UART1 TX signal</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO35</name>
                  <description>Configure as GPIO35</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2SDAT</name>
                  <description>I2S serial data output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT27</name>
                  <description>CTIMER connection 27</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0RTS</name>
                  <description>Configure as the UART0 RTS output</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD35STRNG</name>
              <description>Pad 35 drive strength</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD35INPEN</name>
              <description>Pad 35 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD35PULL</name>
              <description>Pad 35 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD34FNCSEL</name>
              <description>Pad 34 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE6</name>
                  <description>Configure as the analog input for ADC single ended input 6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE34</name>
                  <description>IOM/MSPI nCE group 34</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA1RTS</name>
                  <description>Configure as the UART1 RTS output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO34</name>
                  <description>Configure as GPIO34</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMPRF2</name>
                  <description>Configure as the analog comparator reference 2 signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0RTS</name>
                  <description>Configure as the UART0 RTS output</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0RX</name>
                  <description>Configure as the UART0 RX input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDMDATA</name>
                  <description>PDM serial data input</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD34STRNG</name>
              <description>Pad 34 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD34INPEN</name>
              <description>Pad 34 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD34PULL</name>
              <description>Pad 34 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD33FNCSEL</name>
              <description>Pad 33 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE5</name>
                  <description>Configure as the analog ADC single ended port 5 input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE33</name>
                  <description>IOM/MSPI nCE group 33</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32kHzXT</name>
                  <description>Configure as the 32kHz crystal output signal</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO33</name>
                  <description>Configure as GPIO33</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0CTS</name>
                  <description>Configure as the UART0 CTS input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT23</name>
                  <description>CTIMER connection 23</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as the serial trace data output signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD33STRNG</name>
              <description>Pad 33 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD33INPEN</name>
              <description>Pad 33 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD33PULL</name>
              <description>Pad 33 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD32FNCSEL</name>
              <description>Pad 32 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE4</name>
                  <description>Configure as the analog input for ADC single ended input 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE32</name>
                  <description>IOM/MSPI nCE group 32</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT15</name>
                  <description>CTIMER connection 15</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO32</name>
                  <description>Configure as GPIO32</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCCIO</name>
                  <description>SCARD serial data input/output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLF</name>
                  <description>External input to the LFRC oscillator</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA1CTS</name>
                  <description>Configure as the UART1 CTS input</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD32STRNG</name>
              <description>Pad 32 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD32INPEN</name>
              <description>Pad 32 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD32PULL</name>
              <description>Pad 32 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGJ</name>
          <description>This register controls the pad configuration controls for PAD39 through PAD36. Writes to this register must be unlocked by the PADKEY register.</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0xFF3FBF3F</resetMask>

