pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
          <fields>
            <field>
              <name>GPIO15INTD</name>
              <description>GPIO15 interrupt direction, nCE polarity.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD15FNCSEL = NCE15 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD15FNCSEL = NCE15 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO15OUTCFG</name>
              <description>GPIO15 output configuration.</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD15FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD15FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD15FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD15FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO15INCFG</name>
              <description>GPIO15 input enable.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO14INTD</name>
              <description>GPIO14 interrupt direction, nCE polarity.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD14FNCSEL = NCE14 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD14FNCSEL = NCE14 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO14OUTCFG</name>
              <description>GPIO14 output configuration.</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD14FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD14FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD14FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD14FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO14INCFG</name>
              <description>GPIO14 input enable.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO13INTD</name>
              <description>GPIO13 interrupt direction, nCE polarity.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD13FNCSEL = NCE13 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD13FNCSEL = NCE13 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO13OUTCFG</name>
              <description>GPIO13 output configuration.</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD13FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD13FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD13FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD13FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO13INCFG</name>
              <description>GPIO13 input enable.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO12INTD</name>
              <description>GPIO12 interrupt direction, nCE polarity.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD12FNCSEL = NCE12 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD12FNCSEL = NCE12 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO12OUTCFG</name>
              <description>GPIO12 output configuration.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD12FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD12FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD12FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD12FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO12INCFG</name>
              <description>GPIO12 input enable.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO11INTD</name>
              <description>GPIO11 interrupt direction, nCE polarity.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD11FNCSEL = NCE11 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD11FNCSEL = NCE11 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO11OUTCFG</name>
              <description>GPIO11 output configuration.</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD11FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD11FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD11FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD11FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO11INCFG</name>
              <description>GPIO11 input enable.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO10INTD</name>
              <description>GPIO10 interrupt direction, nCE polarity.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD10FNCSEL = NCE10 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD10FNCSEL = NCE10 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO10OUTCFG</name>
              <description>GPIO10 output configuration.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD10FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD10FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD10FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD10FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO10INCFG</name>
              <description>GPIO10 input enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO9INTD</name>
              <description>GPIO9 interrupt direction, nCE polarity.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD9FNCSEL = NCE9 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD9FNCSEL = NCE9 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO9OUTCFG</name>
              <description>GPIO9 output configuration.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD9FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD9FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD9FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD9FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO9INCFG</name>
              <description>GPIO9 input enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO8INTD</name>
              <description>GPIO8 interrupt direction, nCE polarity.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD8FNCSEL = NCE8 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD8FNCSEL = NCE8 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO8OUTCFG</name>
              <description>GPIO8 output configuration.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD8FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD8FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD8FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD8FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO8INCFG</name>
              <description>GPIO8 input enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGC</name>
          <description>GPIO configuration controls for GPIO[23:16]. Writes to this register must be unlocked by the PADKEY register.</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

