pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
          <fields>
            <field>
              <name>GPIO23INTD</name>
              <description>GPIO23 interrupt direction, nCE polarity.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD23FNCSEL = NCE23 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD23FNCSEL = NCE23 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO23OUTCFG</name>
              <description>GPIO23 output configuration.</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD23FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD23FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD23FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD23FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO23INCFG</name>
              <description>GPIO23 input enable.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO22INTD</name>
              <description>GPIO22 interrupt direction, nCE polarity.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD22FNCSEL = NCE22 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD22FNCSEL = NCE22 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO22OUTCFG</name>
              <description>GPIO22 output configuration.</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD22FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD22FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD22FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD22FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO22INCFG</name>
              <description>GPIO22 input enable.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO21INTD</name>
              <description>GPIO21 interrupt direction, nCE polarity.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD21FNCSEL = NCE21 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD21FNCSEL = NCE21 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO21OUTCFG</name>
              <description>GPIO21 output configuration.</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD21FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD21FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD21FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD21FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO21INCFG</name>
              <description>GPIO21 input enable.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO20INTD</name>
              <description>GPIO20 interrupt direction, nCE polarity.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD20FNCSEL = NCE20 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD20FNCSEL = NCE20 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO20OUTCFG</name>
              <description>GPIO20 output configuration.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD20FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD20FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD20FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD20FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO20INCFG</name>
              <description>GPIO20 input enable.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO19INTD</name>
              <description>GPIO19 interrupt direction, nCE polarity.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD19FNCSEL = NCE19 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD19FNCSEL = NCE19 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO19OUTCFG</name>
              <description>GPIO19 output configuration.</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD19FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD19FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD19FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD19FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO19INCFG</name>
              <description>GPIO19 input enable.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO18INTD</name>
              <description>GPIO18 interrupt direction, nCE polarity.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD18FNCSEL = NCE18 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD18FNCSEL = NCE18 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO18OUTCFG</name>
              <description>GPIO18 output configuration.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD18FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD18FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD18FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD18FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO18INCFG</name>
              <description>GPIO18 input enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO17INTD</name>
              <description>GPIO17 interrupt direction, nCE polarity.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD17FNCSEL = NCE17 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD17FNCSEL = NCE17 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO17OUTCFG</name>
              <description>GPIO17 output configuration.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD17FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD17FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD17FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD17FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO17INCFG</name>
              <description>GPIO17 input enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO16INTD</name>
              <description>GPIO16 interrupt direction, nCE polarity.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD16FNCSEL = NCE16 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD16FNCSEL = NCE16 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO16OUTCFG</name>
              <description>GPIO16 output configuration.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD16FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD16FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD16FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD16FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO16INCFG</name>
              <description>GPIO16 input enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Read-back will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGD</name>
          <description>GPIO configuration controls for GPIO[31:24]. Writes to this register must be unlocked by the PADKEY register.</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

