pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGR</name>
          <description>This register has additional configuration control for pads [71:68]</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x11111111</resetMask>

          <fields>
            <field>
              <name>PAD71_SR</name>
              <description>Pad 71 slew rate selection.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD71_DS1</name>
              <description>Pad 71 high order drive strength selection. Used in conjunction with PAD71STRNG field to set the pad drive strength.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD70_SR</name>
              <description>Pad 71 slew rate selection.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD70_DS1</name>
              <description>Pad 70 high order drive strength selection. Used in conjunction with PAD70STRNG field to set the pad drive strength.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD69_SR</name>
              <description>Pad 71 slew rate selection.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD69_DS1</name>
              <description>Pad 69 high order drive strength selection. Used in conjunction with PAD69STRNG field to set the pad drive strength.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD68_SR</name>
              <description>Pad 71 slew rate selection.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD68_DS1</name>
              <description>Pad 68 high order drive strength selection. Used in conjunction with PAD68STRNG field to set the pad drive strength.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGS</name>
          <description>This register has additional configuration control for pads [73:72]</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001111</resetMask>

          <fields>
            <field>
              <name>PAD73_SR</name>
              <description>Pad 73 slew rate selection.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD73_DS1</name>
              <description>Pad 73 high order drive strength selection. Used in conjunction with PAD73STRNG field to set the pad drive strength.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD72_SR</name>
              <description>Pad 72 slew rate selection.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD72_DS1</name>
              <description>Pad 72 high order drive strength selection. Used in conjunction with PAD72STRNG field to set the pad drive strength.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SCDET</name>
          <description>SCARD card detect select.</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>SCDET</name>
              <description>SCARD card detect pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

