pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>GPIO68</name>
              <description>GPIO68 interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO67</name>
              <description>GPIO67 interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO66</name>
              <description>GPIO66 interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO65</name>
              <description>GPIO65 interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO64</name>
              <description>GPIO64 interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug control for test purposes only</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>GCLK5</name>
              <description>Gate IOM5 CLK in SPI mode, allowing external input clock</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GCLK4</name>
              <description>Gate IOM4 CLK in SPI mode, allowing external input clock</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GCLK3</name>
              <description>Gate IOM3 CLK in SPI mode, allowing external input clock</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GCLK2</name>
              <description>Gate IOM2 CLK in SPI mode, allowing external input clock</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GCLK1</name>
              <description>Gate IOM1 CLK in SPI mode, allowing external input clock</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GCLK0</name>
              <description>Gate IOM0 CLK in SPI mode, allowing external input clock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>IOM0</name>
      <version>1.0</version>
      <description>IO Peripheral Master</description>
      <!-- <groupName>GROUP_IOM</groupName> -->
      <baseAddress>0x50004000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000414</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IOMSTR0</name>
        <description>IOMSTR0_IRQ</description>
        <value>6</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFO</name>
          <description>Provides direct random access to both output and input FIFOs. The state of the FIFO is not disturbed by reading these locations (i.e., no POP will be done). FIFO0 is accessible from addresses 0x0 - 0x1C, and is used for data output from the IOM to external devices. These FIFO locations can be read and written directly.
FIFO1 locations 0x20 - 0x3C provide read only access to the input FIFO. These FIFO locations cannot be directly written by the MCU and are updated only by the internal hardware. Writes to FIFO0 will take effect immediately. The FIFO pointers
in register FIFOLOC indicate the current offset into each FIFO for the read and write operations.
Access to the FIFOs can only be done in word increments; byte reads and writes are not supported.
Push and pop style access to FIFO0 can be accomplished using the FIFOPOP and FIFOPUSH registers below.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>FIFO direct access. Only locations 0 - 3F will return valid information.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPTR</name>
          <description>Provides the current valid byte count of data within the FIFO as seen from the internal state machines. FIFO0 is dedicated to outgoing transactions and FIFO1 is dedicated to incoming transactions. All counts are specified in units of bytes.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO1REM</name>
              <description>The number of remaining data bytes slots currently in FIFO 1 (written by interface, read by MCU)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFO1SIZ</name>
              <description>The number of valid data bytes currently in FIFO 1 (written by interface, read by MCU)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

