pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>CQUPD</name>
              <description>CQ write operation performed a register write with the register address bit 0 set to 1. The low address bits in the CQ address fields are unused and bit 0 can be used to trigger an interrupt to indicate when this register write is performed by the CQ operation.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQPAUSED</name>
              <description>Command queue is paused due to an active event enabled in the PAUSEEN register. The interrupt is posted when the event is enabled within the PAUSEEN register, the mask is active in the CQIRQMASK field and the event occurs.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DERR</name>
              <description>DMA Error encountered during the processing of the DMA command. The DMA error could occur when the memory access specified in the DMA operation is not available or incorrectly specified.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Complete. Processing of the DMA operation has completed and the DMA submodule is returned into the idle state</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ARB</name>
              <description>Arbitration loss interrupt. Asserted when arbitration is enabled and has been lost to another master on the bus.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STOP</name>
              <description>STOP command interrupt. Asserted when another master on the bus has signaled a STOP command.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>START</name>
              <description>START command interrupt. Asserted when another master on the bus has signaled a START command.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ICMD</name>
              <description>illegal command interrupt. Asserted when a command is written when an active command is in progress.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IACC</name>
              <description>illegal FIFO access interrupt. Asserted when there is a overflow or underflow event</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>NAK</name>
              <description>I2C NAK interrupt. Asserted when an unexpected NAK has been received on the I2C bus.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FOVFL</name>
              <description>Write FIFO Overflow interrupt. This occurs when software tries to write to a full FIFO. The current operation does not stop.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNDFL</name>
              <description>Read FIFO Underflow interrupt. This occurs when software tries to pop from an empty FIFO.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>THR</name>
              <description>FIFO Threshold interrupt. For write operations, asserted when the number of free bytes in the write FIFO equals or exceeds the WTHR field.
For read operations, asserted when the number of valid bytes in the read FIFO equals of exceeds the value set in the RTHR field.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDCMP</name>
              <description>Command complete interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCFG</name>
          <description>Provides clock related controls used internal to the BLEIF module, and enablement of 32KHz clock to the BLE Core module. The internal clock sourced is selected via the FSEL and can be further divided by 3 using the DIV3 control.
This register is also used to enable the clock, which must be done prior to performing any IO transactions.</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1F01</resetMask>

          <fields>
            <field>
              <name>TOTPER</name>
              <description>Clock total clock count minus 1. This provides the total period of the divided clock -1 when the DIVEN is active. The
source clock is selected by FSEL. Only applicable when DIVEN = 1.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOWPER</name>
              <description>Clock low clock count minus 1. This provides the number of clocks the divided clock will be low when the DIVEN = 1.
Only applicable when DIVEN = 1.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

