pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>DIVEN</name>
              <description>Enable clock division by TOTPER and LOWPER</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TOTPER division.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable TOTPER division.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIV3</name>
              <description>Enable divide by 3 of the source IOCLK. Division by 3 is done before the DIVEN programmable divider, and if enabled
will provide the divided by 3 clock as the source to the programmable divider.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Select divide by 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Select divide by 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSEL</name>
              <description>Select the input clock frequency.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN_PWR</name>
                  <description>Selects the minimum power clock. This setting should be used whenever the IOM is not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC</name>
                  <description>Selects the HFRC as the input clock.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV2</name>
                  <description>Selects the HFRC / 2 as the input clock.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Selects the HFRC / 4 as the input clock.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV8</name>
                  <description>Selects the HFRC / 8 as the input clock.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>Selects the HFRC / 16 as the input clock.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV32</name>
                  <description>Selects the HFRC / 32 as the input clock.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV64</name>
                  <description>Selects the HFRC / 64 as the input clock.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOCLKEN</name>
              <description>Enable for the interface clock. Must be enabled prior to executing any IO operations.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SUBMODCTRL</name>
          <description>Provides enable for each submodule. Only a single submodule can be enabled at one time.</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SMOD1TYPE</name>
              <description>Submodule 0 module type. This is the I2C Master interface</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSPI</name>
                  <description>SPI Master submodule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MASTER</name>
                  <description>MI2C submodule</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSPI</name>
                  <description>SPI Slave submodule</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SI2C</name>
                  <description>I2C Slave submodule</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>NOT INSTALLED</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOD1EN</name>
              <description>Submodule 1 enable (1) or disable (0)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

