pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>SPHA</name>
              <description>selects SPI phase.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_LEADING_EDGE</name>
                  <description>Sample on the leading (first) clock edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_TRAILING_EDGE</name>
                  <description>Sample on the trailing (second) clock edge.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPOL</name>
              <description>selects SPI polarity.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_BASE_0</name>
                  <description>The base value of the clock is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_BASE_1</name>
                  <description>The base value of the clock is 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MI2CCFG</name>
          <description>Controls the configuration of the I2C bus master.</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFF77</resetMask>

          <fields>
            <field>
              <name>STRDIS</name>
              <description>Disable detection of clock stretch events smaller than 1 cycle</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SMPCNT</name>
              <description>Number of Base clock cycles to wait before sampling the SCL clock to determine if a clock stretch event has occurred</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDAENDLY</name>
              <description>Number of IOCLK cycles to delay the SDA output en (all transitions affected). Used to delay data relative to clock</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCLENDLY</name>
              <description>Number of IOCLK cycles to delay the rising edge of the SCL output en (clock will go low on this edge). Used to allow clock shaping.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MI2CRST</name>
              <description>Not used. To reset the module, toggle the SMOD_EN for the module</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDADLY</name>
              <description>Delay to enable on the SDA output. Values are 0x0-0x3.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ARBEN</name>
              <description>Enables multi-master arbitration for the I2C master. If the bus is known to have only a single master, this function can be disabled to save clock cycles on I2C transactions</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARBEN</name>
                  <description>Enable multi-master bus arbitration support for this I2C master</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARBDIS</name>
                  <description>Disable multi-master bus arbitration support for this I2C master</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2CLSB</name>
              <description>Direction of data transmit and receive, MSB(0) or LSB(1) first. Default per I2C specification is MSB first. This applies to both read and write data, and read data will be bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSBFIRST</name>
                  <description>Byte data is transmitted MSB first onto the bus/read from the bus</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSBFIRST</name>
                  <description>Byte data is transmitted LSB first onto the bus/read from the bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRSZ</name>
              <description>Sets the I2C master device address size to either 7 bits (0) or 10 bits (1).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDRSZ7</name>
                  <description>Use 7-bit addressing for I2C master transactions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDRSZ10</name>
                  <description>Use 10-bit addressing for I2C master transactions</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVCFG</name>
          <description>Contains the I2C device address.</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>DEVADDR</name>
              <description>I2C address of the device that the Master will use to target for read/write operations. This can be either a 7-bit or 10-bit address.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

