pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IOMDBG</name>
          <description>Debug control</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DBGDATA</name>
              <description>Debug control for various options. DBGDATA[1:0] is used to select between different debug data available in the DBG0 and DBG1 registers.</description>
              <bitRange>[31:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCLKON</name>
              <description>APBCLK debug clock control. Enable APB_CLK to be active when this bit is '1'. Otherwise, the clock is controlled with gating from the logic as needed.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOCLKON</name>
              <description>IOCLK debug clock control. Enable IO_CLK to be active when this bit is '1'. Otherwise, the clock is controlled with gating from the logic as needed.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBGEN</name>
              <description>Debug Enable. Setting bit will enable the update of data within this register, otherwise it is clock gated for power savings</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="IOM0">
      <name>IOM1</name>
      <baseAddress>0x50005000</baseAddress>
      <interrupt>
        <name>IOMSTR1</name>
        <description>IOMSTR1_IRQ</description>
        <value>7</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="IOM0">
      <name>IOM2</name>
      <baseAddress>0x50006000</baseAddress>
      <interrupt>
        <name>IOMSTR2</name>
        <description>IOMSTR2_IRQ</description>
        <value>8</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="IOM0">
      <name>IOM3</name>
      <baseAddress>0x50007000</baseAddress>
      <interrupt>
        <name>IOMSTR3</name>
        <description>IOMSTR3_IRQ</description>
        <value>9</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="IOM0">
      <name>IOM4</name>
      <baseAddress>0x50008000</baseAddress>
      <interrupt>
        <name>IOMSTR4</name>
        <description>IOMSTR4_IRQ</description>
        <value>10</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="IOM0">
      <name>IOM5</name>
      <baseAddress>0x50009000</baseAddress>
      <interrupt>
        <name>IOMSTR5</name>
        <description>IOMSTR5_IRQ</description>
        <value>11</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>IOSLAVE</name>
      <version>1.0</version>
      <description>I2C/SPI Slave</description>
      <!-- <groupName>GROUP_IOSLAVE</groupName> -->
      <baseAddress>0x50000000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000220</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IOSLAVE</name>
        <description>IOSLAVE_IRQ</description>
        <value>4</value>
      </interrupt>      <interrupt>
        <name>IOSLAVEACC</name>
        <description>IOSLAVEACC_IRQ</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFOPTR</name>
          <description>Current FIFO Pointer</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>FIFOSIZ</name>
              <description>The number of bytes currently in the hardware FIFO.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOPTR</name>
              <description>Current FIFO pointer.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCFG</name>
          <description>FIFO Configuration</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0x3F003F1F</resetMask>

          <fields>
            <field>
              <name>ROBASE</name>
              <description>Defines the read-only area. The IO Slave read-only area is situated in LRAM at (ROBASE*8) to (FIFOBASE*8-1)</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOMAX</name>
              <description>These bits hold the maximum FIFO address in 8 byte segments. It is also the beginning of the RAM area of the LRAM. Note that no RAM area is configured if FIFOMAX is set to 0x1F.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOBASE</name>
              <description>These bits hold the base address of the I/O FIFO in 8 byte segments. The IO Slave FIFO is situated in LRAM at (FIFOBASE*8) to (FIFOMAX*8-1).</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

