pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>BLEREQ</name>
              <description>Controls the BLE functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the BLE functionality</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the BLE functionality</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGGER</name>
          <description>Debugger Control</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LOCKOUT</name>
              <description>Lockout of debugger (SWD).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMWRITEPROTECT2</name>
          <description>These bits write-protect system SRAM from DMA operations in 8KB chunks.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_WPROT2</name>
              <description>Write protect SRAM from DMA. Each bit provides write protection for an 8KB region of memory. When set to 1, the region will be protected from DMA writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VRCTRL1</name>
          <description>PRIMARY Voltage Regulator Control</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001E0</resetMask>

          <fields>
            <field>
              <name>BLEBUCKOVER</name>
              <description>Override control for BLE BUCK signals</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLEBUCKPDNB</name>
              <description>BLE BUCK PDNB control. Override for PWRCTRL going to analog when BLEBUCKOVER = 1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLEBUCKACTIVE</name>
              <description>BLE BUCK ACTIVE control. Override for PWRCTRL going to analog when BLEBUCKOVER = 1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLEBUCKRSTB</name>
              <description>BLE BUCK RSTB control. Override for PWRCTRL going to analog when BLEBUCKOVER = 1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VRCTRL2</name>
          <description>SECONDARY Voltage Regulator Control</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>BURSTLDOOVER</name>
              <description>Override control for BURST LDO signals</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BURSTLDOPDNB</name>
              <description>BURST LDO PDNB control. Override for PWRCTRL going to analog when BURSTLDOOVER = 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BURSTLDOACTIVEEARLY</name>
              <description>BURST LDO EARLY ACTIVE control. Override for PWRCTRL going to analog when BURSTLDOOVER = 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BURSTLDOACTIVE</name>
              <description>BURST LDO ACTIVE control. Override for PWRCTRL going to analog when BURSTLDOOVER = 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BURSTLDOCOLDSTARTEN</name>
              <description>BURST LDO COLDSTART EN control. Override for PWRCTRL going to analog when BURSTLDOOVER = 1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LDOREG1</name>
          <description>CORELDO trims Reg</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0006D3A3</resetValue>
          <resetMask>0x003FFFFF</resetMask>

          <fields>
            <field>
              <name>CORELDOIBIASSEL</name>
              <description>Core LDO Ibias select. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

