pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>CORELDOIBIASTRIM</name>
              <description>CORE LDO Ibias Trim</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOLPTRIM</name>
              <description>CORE LDO Low Power Trim</description>
              <bitRange>[19:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOTEMPCOTRIM</name>
              <description>CORE LDO TEMPCO trim</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOACTIVETRIM</name>
              <description>CORE LDO active trim</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LDOREG2</name>
          <description>MEMLDO and MEMLPLDO Trims</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x207FCF3A</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>

          <fields>
            <field>
              <name>TRIMANALDO</name>
              <description>Analog LDO Trim</description>
              <bitRange>[29:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOIBIASSEL</name>
              <description>Mem LDO Ibias select. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOIBIASTRIM</name>
              <description>Mem LPLDO Ibias trim</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOTRIM</name>
              <description>Mem LPLDO trim</description>
              <bitRange>[23:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOLPALTTRIM</name>
              <description>Mem LDO trim LP alternate set</description>
              <bitRange>[17:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOLPTRIM</name>
              <description>MEM LDO LP trim</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOACTIVETRIM</name>
              <description>MEM LDO active trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCPWRDLY</name>
          <description>ADC Power Up Delay Control</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>ADCPWR1</name>
              <description>ADC Reference Keeper enable delay in 16 ADC CLK increments for ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCPWR0</name>
              <description>ADC Reference Buffer Power Enable delay in 64 ADC CLK increments for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCCAL</name>
          <description>ADC Calibration Control</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>ADCCALIBRATED</name>
              <description>Status for ADC Calibration</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>ADC is not calibrated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>ADC is calibrated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALONPWRUP</name>
              <description>Run ADC Calibration on initial power up sequence</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable automatic calibration on initial power up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable automatic calibration on initial power up</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBATTLOAD</name>
          <description>ADC Battery Load Enable</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BATTLOAD</name>
              <description>Enable the ADC battery load resistor</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Battery load is disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Battery load is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRIM</name>
          <description>ADC Trims</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x00001FC3</resetMask>

          <fields>
            <field>
              <name>ADCRFBUFIBTRIM</name>
              <description>ADC reference buffer input bias trim</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>

