pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>SIMOBUCKMEMLPHIGHTOFFTRIM</name>
              <description>simobuck_mem_lp_high_toff_trim</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCORELPLOWTOFFTRIM</name>
              <description>simobuck_core_lp_low_toff_trim</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCORELPHIGHTOFFTRIM</name>
              <description>simobuck_core_lp_high_toff_trim</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK4</name>
          <description>SIMO Buck Control Reg 4</description>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3C8D80AA</resetValue>
          <resetMask>0x01E0000F</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKCOMP2TIMEOUTEN</name>
              <description>simobuck_comp2_timeout_en</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCOMP2LPEN</name>
              <description>simobuck_comp2_lp_en</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCLKDIVSEL</name>
              <description>simobuck_clkdiv_sel</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKMEMLPLOWTONTRIM</name>
              <description>simobuck_mem_lp_low_ton_trim</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BLEBUCK1</name>
          <description>BLEBUCK1 Control Reg</description>
          <addressOffset>0x00000364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00078000</resetMask>

          <fields>
            <field>
              <name>BLEBUCKPULLUPTRIM</name>
              <description>blebuck_pullup_trim</description>
              <bitRange>[18:15]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BLEBUCK2</name>
          <description>BLEBUCK2 Control Reg</description>
          <addressOffset>0x00000368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000004E</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>BLEBUCKTOND2ATRIM</name>
              <description>blebuck_ton_trim</description>
              <bitRange>[17:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLEBUCKTONHITRIM</name>
              <description>blebuck_ton_hi_trim</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLEBUCKTONLOWTRIM</name>
              <description>blebuck_ton_low_trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHWPROT0</name>
          <description>These bits write-protect flash in 16KB chunks.</description>
          <addressOffset>0x000003A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FW0BITS</name>
              <description>Write protect flash 0x00000000 - 0x0007FFFF. Each bit provides write protection for 16KB chunks of flash data space. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHWPROT1</name>
          <description>These bits write-protect flash in 16KB chunks.</description>
          <addressOffset>0x000003A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FW1BITS</name>
              <description>Write protect flash 0x00080000 - 0x000FFFFF. Each bit provides write protection for 16KB chunks of flash data space. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHWPROT2</name>
          <description>These bits write-protect flash in 16KB chunks.</description>
          <addressOffset>0x000003A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FW2BITS</name>
              <description>Write protect flash 0x00100000 - 0x0017FFFF. Each bit provides write protection for 16KB chunks of flash data space. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

