pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMREADPROTECT0</name>
          <description>These bits read-protect system SRAM from DMA operations in 8KB chunks.</description>
          <addressOffset>0x000003D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_RPROT0</name>
              <description>Read protect SRAM from DMA. Each bit provides write protection for an 8KB region of memory. When set to 1, the region will be protected from DMA reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMREADPROTECT1</name>
          <description>These bits read-protect system SRAM from DMA operations in 8KB chunks.</description>
          <addressOffset>0x000003D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_RPROT1</name>
              <description>Read protect SRAM from DMA. Each bit provides write protection for an 8KB region of memory. When set to 1, the region will be protected from DMA reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMREADPROTECT2</name>
          <description>These bits read-protect system SRAM from DMA operations in 8KB chunks.</description>
          <addressOffset>0x000003D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_RPROT2</name>
              <description>Read protect SRAM from DMA. Each bit provides write protection for an 8KB region of memory. When set to 1, the region will be protected from DMA reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>MSPI0</name>
      <version>1.0</version>
      <description>Multi-bit SPI Master</description>
      <!-- <groupName>GROUP_MSPI</groupName> -->
      <baseAddress>0x50014000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x000002C8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MSPI0</name>
        <description>MSPI0_IRQ</description>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>This register is used to enable individual PIO based transactions to a device on the bus. The CFG register must be programmed properly for the transfer, and the ADDR and INSTR registers should be programmed if the SENDI and SENDA fields are enabled.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1FFF</resetMask>

          <fields>
            <field>
              <name>XFERBYTES</name>
              <description>Number of bytes to transmit or receive (based on TXRX bit)</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENDCX</name>
              <description>Enable DCX signal on data [1]</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PIOSCRAMBLE</name>
              <description>Enables data scrambling for PIO operations. This should only be used for data operations and never for commands to a device.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXRX</name>
              <description>1 Indicates a TX operation, 0 indicates an RX operation of XFERBYTES</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SENDI</name>
              <description>Indicates whether an instruction phase should be sent (see INSTR field and ISIZE field in CFG register)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SENDA</name>
              <description>Indicates whether an address phase should be sent (see ADDR register and ASIZE field in CFG register)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENTURN</name>
              <description>Indicates whether TX->RX turnaround cycles should be enabled for this operation (see TURNAROUND field in CFG register).</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BIGENDIAN</name>
              <description>1 indicates data in FIFO is in big endian format (MSB first); 0 indicates little endian data (default, LSB first).</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

