pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>CONT</name>
              <description>Continuation transfer. When 1, indicates that the MSPI will hold CE low after the transaction completes. This is included for compatibility with IOM module since the MSPI transfer module can handle most cases in a single transfer. NOTE:  CONT functionality only works with CLKDIV=2 (24 MHz).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENWLAT</name>
              <description>Enable Write Latency Counter (time between address and first data byte). Counter value is WRITELATENCY.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>QUADCMD</name>
              <description>Flag indicating that the operation is a command that should be replicated to both devices in paired QUAD mode. This is typically only used when reading/writing configuration registers in paired flash devices (do not set for memory transfers).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BUSY</name>
              <description>Command status:  1 indicates controller is busy (command in progress)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATUS</name>
              <description>Command status:  1 indicates command has completed. Cleared by writing 1 to this bit or starting a new transfer.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>START</name>
              <description>Write to 1 to initiate a PIO transaction on the bus (typically the entire register should be written at once with this bit set).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Command formatting for PIO based transactions (initiated by writes to CTRL register)</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x03F33FFF</resetMask>

          <fields>
            <field>
              <name>WRITELATENCY</name>
              <description>Number of cycles between addressn and TX data. Qualified by ENLAT</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPOL</name>
              <description>Serial clock polarity.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Clock inactive state is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Clock inactive state is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Serial clock phase.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIDDLE</name>
                  <description>Clock toggles in middle of data bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Clock toggles at start of data bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TURNAROUND</name>
              <description>Number of turnaround cycles (for TX->RX transitions). Qualified by ENTURN or XIPENTURN bit field.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SEPIO</name>
              <description>Separate IO configuration. This bit should be set when the target device has separate MOSI and MISO pins. Respective IN/OUT bits below should be set to map pins.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ISIZE</name>
              <description>Instruction Size
enum
  name    =   I8
  value   =   0x0
  desc    =   Instruction is 1 byte
enum
  name    =   I16
  value   =   0x1
  desc    =   Instruction is 2 bytes</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ASIZE</name>
              <description>Address Size. Address bytes to send from ADDR register</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A1</name>
                  <description>Send one address byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2</name>
                  <description>Send two address bytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3</name>
                  <description>Send three address bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4</name>
                  <description>Send four address bytes</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVCFG</name>
              <description>Flash configuration for XIP and AUTO DMA operations. Controls value for SER (Slave Enable) for XIP operations and address generation for DMA/XIP modes. Also used to configure SPIFRF (frame format).</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SERIAL0</name>
                  <description>Single bit SPI flash on chip select 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL1</name>
                  <description>Single bit SPI flash on chip select 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL0</name>
                  <description>Dual SPI flash on chip select 0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL1</name>
                  <description>Dual bit SPI flash on chip select 1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD0</name>
                  <description>Quad SPI flash on chip select 0</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD1</name>
                  <description>Quad SPI flash on chip select 1</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTAL0</name>
                  <description>Octal SPI flash on chip select 0</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTAL1</name>
                  <description>Octal SPI flash on chip select 1</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <description>Optional Address field to send for PIO transfers</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Optional Address field to send (after optional instruction field) - qualified by ASIZE in CMD register. NOTE:  This register is aliased to DMADEVADDR.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

