pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>INSTR</name>
          <description>Optional Instruction field to send for PIO transfers</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>INSTR</name>
              <description>Optional Instruction field to send (1st byte) - qualified by ISEND/ISIZE</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFO</name>
          <description>TX Data FIFO</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TXFIFO</name>
              <description>Data to be transmitted. Data should normally be aligned to the LSB (pad the upper bits with zeros) unless BIGENDIAN is set.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFO</name>
          <description>RX Data FIFO</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RXFIFO</name>
              <description>Receive data. Data is aligned to the LSB (padded zeros on upper bits) unless BIGENDIAN is set.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXENTRIES</name>
          <description>Number of words in TX FIFO</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>TXENTRIES</name>
              <description>Number of 32-bit words/entries in TX FIFO</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RXENTRIES</name>
          <description>Number of words in RX FIFO</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>RXENTRIES</name>
              <description>Number of 32-bit words/entries in RX FIFO</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>THRESHOLD</name>
          <description>Threshold levels that trigger RXFull and TXEmpty interrupts</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003F3F</resetMask>

          <fields>
            <field>
              <name>RXTHRESH</name>
              <description>Number of entries in TX FIFO that cause RXE interrupt</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXTHRESH</name>
              <description>Number of entries in TX FIFO that cause TXF interrupt</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MSPICFG</name>
          <description>Timing configuration bits for the MSPI module. PRSTN, IPRSTN, and FIFORESET can be used to reset portions of the MSPI interface in order to clear error conditions. The remaining bits control clock frequency and TX/RX capture timings.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000200</resetValue>
          <resetMask>0xE0003FFF</resetMask>

          <fields>
            <field>
              <name>PRSTN</name>
              <description>Peripheral reset. Master reset to the entire MSPI module (DMA, XIP, and transfer state machines). 1=normal operation, 0=in reset.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IPRSTN</name>
              <description>IP block reset. Write to 0 to put the transfer module in reset or 1 for normal operation. This may be required after error conditions to clear the transfer on the bus.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFORESET</name>
              <description>Reset MSPI FIFO (active high). 1=reset FIFO, 0=normal operation.  May be used to manually flush the FIFO in error handling.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock Divider. Allows dividing 48 MHz base clock by integer multiples. Enumerations are provided for common frequency, but any integer divide from 48 MHz is allowed. Odd divide ratios will result in a 33/66 percent duty cycle with a long low clock pulse (to allow longer round-trip for read data).</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK48</name>
                  <description>48 MHz MSPI clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK24</name>
                  <description>24 MHz MSPI clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK12</name>
                  <description>12 MHz MSPI clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK6</name>
                  <description>6 MHz MSPI clock</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK3</name>
                  <description>3 MHz MSPI clock</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1_5</name>
                  <description>1.5 MHz MSPI clock</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMSEL</name>
              <description>Selects which IOM is selected for CQ handshake status.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOM0</name>
                  <description>Select IOM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1</name>
                  <description>Select IOM1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM2</name>
                  <description>Select IOM2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM3</name>
                  <description>Select IOM3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM4</name>
                  <description>Select IOM4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM5</name>
                  <description>Select IOM5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI0</name>
                  <description>Select MSPI0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI1</name>
                  <description>Select MSPI1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI2</name>
                  <description>Select MSPI2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No IOM selected. Signals always zero.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXNEG</name>
              <description>Launches TX data a half clock cycle (~10 ns) early. This should normally be programmed to zero (NORMAL).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>TX launched from posedge internal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>TX data launched from negedge of internal clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXNEG</name>
              <description>Adjusts the RX capture phase to the negedge of the 48MHz internal clock (~10 ns early). For normal operation, it is expected that RXNEG will be set to 0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RX data sampled on posedge of internal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>RX data sampled on negedge of internal clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXCAP</name>
              <description>Controls RX data capture phase. A setting of 0 (NORMAL) captures read data at the normal capture point relative to the internal clock launch point. However, to accommodate chip/pad/board delays, a setting of RXCAP of 1 is expected to be used to align the capture point with the return data window. This bit is used in conjunction with RXNEG to provide 4 unique capture points, all about 10 ns apart.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RX Capture phase aligns with CPHA setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY</name>
                  <description>RX Capture phase is delayed from CPHA setting by one clock edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APBCLK</name>
              <description>Enable continuous APB clock. For power-efficient operation, APBCLK should be set to 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable continuous clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable continuous clock.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPIDDR</name>
          <description>Timing configuration bits for DDR operation of the MSPI module.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001F1F7F</resetMask>

          <fields>
            <field>
              <name>TXDQSDELAY</name>
              <description>When OVERRIDEDQSDELAY is set this sets the DQS delay line value. In ENABLEDQS mode, this acts as an offset to the computed value (should be set to 0 by default)</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>

