pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DMABCOUNT</name>
          <description>DMA BYTE Transfer Count</description>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BCOUNT</name>
              <description>Burst transfer size in bytes. This is the number of bytes transferred when a FIFO trigger event occurs. Recommended value is 32.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATHRESH</name>
          <description>Indicates FIFO level at which a DMA should be triggered. For most configurations, a setting of 8 is recommended for both read and write operations.</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <resetMask>0x00001F1F</resetMask>

          <fields>
            <field>
              <name>DMARXTHRESH</name>
              <description>DMA transfer FIFO level trigger. For read operations, DMA is triggered when the FIFO level is greater than this value. For write operations, DMA is triggered when the FIFO level is less than this level. Each DMA operation will consist of BCOUNT bytes.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMATXTHRESH</name>
              <description>DMA transfer FIFO level trigger. For read operations, DMA is triggered when the FIFO level is greater than this value. For write operations, DMA is triggered when the FIFO level is less than this level. Each DMA operation will consist of BCOUNT bytes.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMABOUNDARY</name>
          <description>Allows large transfers to be broken up into smaller ones in hardware to accommodate needs of external devices and allow XIP/XIPMM. Only applicable for memory-mapped devices (PSRAM, Flash, etc) where address can be retransmitted without side effects.</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DMABOUND</name>
              <description>DMA Address boundary</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Disable DMA address boundary breaks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK32</name>
                  <description>Break at 32 byte boundary (0x20 increments)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK64</name>
                  <description>Break at 64 byte boundary (0x40 increments)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK128</name>
                  <description>Break at 128 byte boundary (0x80 increments)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK256</name>
                  <description>Break at 256 byte boundary (0x100 increments)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK512</name>
                  <description>Break at 512 byte boundary (0x200 increments)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK1K</name>
                  <description>Break at 1KB boundary (0x400 increments)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK2K</name>
                  <description>Break at 2KB boundary (0x800 increments)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK4K</name>
                  <description>Break at 4KB boundary (0x1000 increments)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK8K</name>
                  <description>Break at 8KB boundary (0x2000 increments)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK16K</name>
                  <description>Break at 16KB boundary (0x4000 increments)</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMATIMELIMIT</name>
              <description>DMA time limit. Can be used to limit the transaction time on the MSPI bus. The count is in 100 ns increments. A value of 0 disables the counter.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQCFG</name>
          <description>This register controls Command Queuing (CQ) operations in a manner similar to the DMACFG register.</description>
          <addressOffset>0x000002A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>CQAUTOCLEARMASK</name>
              <description>Enable clear of CQMASK after each pause operation. This may be useful when using software flags to pause CQ.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

