pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>CQPWROFF</name>
              <description>Power off MSPI domain upon completion of DMA operation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQPRI</name>
              <description>Sets the Priority of the command queue DMA request</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CQEN</name>
              <description>Command queue enable. When set, will enable the processing of the command queue</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CQ Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CQ Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CQADDR</name>
          <description>Location of the command queue in SRAM or flash memory. This register will increment as CQ operations commence. Software should only write CQADDR when CQEN is disabled, however the command queue script itself may update CQADDR in order to perform queue management functions (like resetting the pointers)</description>
          <addressOffset>0x000002A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>

          <fields>
            <field>
              <name>CQADDR</name>
              <description>Address of command queue buffer in SRAM or flash. The buffer address must be aligned to a word boundary.</description>
              <bitRange>[28:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQSTAT</name>
          <description>Command Queue Status</description>
          <addressOffset>0x000002AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>CQPAUSED</name>
              <description>Command queue is currently paused status.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQERR</name>
              <description>Command queue processing  Error. This active high bit signals that an error was encountered during the CQ  operation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQCPL</name>
              <description>Command queue operation Complete. This signals the end of the command queue operation.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQTIP</name>
              <description>Command queue Transfer In Progress indicator. 1 will indicate that a CQ transfer is active and this will remain active even when paused waiting for external event.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQFLAGS</name>
          <description>Command Queue Flags</description>
          <addressOffset>0x000002B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CQFLAGS</name>
              <description>Current flag status (read-only). Bits [7:0] are software controllable and bits [15:8] are hardware status.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>CQ Stop Flag. When set, CQ processing will complete.</description>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CQIDX</name>
                  <description>CQ Index Pointers (CURIDX/ENDIDX) match.</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF1XOREN</name>
                  <description>Buffer 1 Ready Status (from selected IOM/MSPI). This status is the result of XOR'ing the IOM1START with the incoming status from the IOM. When high, MSPI can transfer the buffer.</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF0XOREN</name>
                  <description>Buffer 0 Ready Status (from selected IOM/MSPI). This status is the result of XOR'ing the IOM0START with the incoming status from the IOM. When high, MSPI can transfer the buffer.</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMACPL</name>
                  <description>DMA Complete Status (hardwired DMACPL bit in DMASTAT)</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDCPL</name>
                  <description>PIO Operation completed (STATUS bit in CTRL register)</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1READY</name>
                  <description>IOM Buffer 1 Ready Status (from selected IOM). This status is the result of XNOR'ing the IOM0START with the incoming status from the IOM. When high, MSPI can send to the buffer.</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM0READY</name>
                  <description>IOM Buffer 0 Ready Status (from selected IOM). This status is the result of XNOR'ing the IOM0START with the incoming status from the IOM. When high, MSPI can send to the buffer.</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG7</name>
                  <description>Software flag 7. Can be used by software to start/pause operations.</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG6</name>
                  <description>Software flag 6. Can be used by software to start/pause operations.</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG5</name>
                  <description>Software flag 5. Can be used by software to start/pause operations.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG4</name>
                  <description>Software flag 4. Can be used by software to start/pause operations.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG3</name>
                  <description>Software flag 3. Can be used by software to start/pause operations.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG2</name>
                  <description>Software flag 2. Can be used by software to start/pause operations.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG1</name>
                  <description>Software flag 1. Can be used by software to start/pause operations.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG0</name>
                  <description>Software flag 0. Can be used by software to start/pause operations.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CQSETCLEAR</name>
          <description>Command Queue Flag Set/Clear</description>
          <addressOffset>0x000002B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>CQFCLR</name>
              <description>Clear CQFlag status bits.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

