pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
          <fields>
            <field>
              <name>CACHEPWDSLP</name>
              <description>power down cache in deep sleep</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power down cache in deep sleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Retain cache in deep sleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH1PWDSLP</name>
              <description>Power-down FLASH1 in deep sleep</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>FLASH1 is powered down during deep sleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FLASH1 is kept powered on during deep sleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH0PWDSLP</name>
              <description>Power-down FLASH0 in deep sleep</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>FLASH0 is powered down during deep sleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FLASH0 is kept powered on during deep sleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMPWDSLP</name>
              <description>Selects which SRAM banks are powered down in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[12:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All banks retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>SRAM GROUP0 powered down (64KB-128KB)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>SRAM GROUP1 powered down (128KB-192KB)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2</name>
                  <description>SRAM GROUP2 powered down (192KB-256KB)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP3</name>
                  <description>SRAM GROUP3 powered down (256KB-320KB)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP4</name>
                  <description>SRAM GROUP4 powered down (320KB-384KB)</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP5</name>
                  <description>SRAM GROUP5 powered down (384KB-448KB)</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP6</name>
                  <description>SRAM GROUP6 powered down (448KB-512KB)</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP7</name>
                  <description>SRAM GROUP7 powered down (512KB-576KB)</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP8</name>
                  <description>SRAM GROUP8 powered down (576KB-672KB)</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP9</name>
                  <description>SRAM GROUP9 powered down (672KB-768KB)</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM128K</name>
                  <description>Power-down lower 128k SRAM (64KB-192KB)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM256K</name>
                  <description>Power-down lower 256k SRAM (64KB-320KB)</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER64K</name>
                  <description>All SRAM banks but lower 64k powered down.</description>
                  <value>1022</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER128K</name>
                  <description>All banks but lower 128k powered down.</description>
                  <value>1020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER256K</name>
                  <description>All banks but lower 256k powered down.</description>
                  <value>1008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All banks powered down.</description>
                  <value>1023</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCMPWDSLP</name>
              <description>power down DTCM in deep sleep</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All DTCM retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM0</name>
                  <description>Group0_DTCM0 powered down in deep sleep (0KB-8KB)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM1</name>
                  <description>Group0_DTCM1 powered down in deep sleep (8KB-32KB)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Both DTCMs in group0 are powered down in deep sleep (0KB-32KB)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTGROUP0DTCM0</name>
                  <description>Group1 and Group0_DTCM1 are powered down in deep sleep (8KB-64KB)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Group1 DTCM powered down in deep sleep (32KB-64KB)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All DTCMs powered down in deep sleep (0KB-64KB)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWREN</name>
          <description>This register enables the individual banks for the memories. When set, power will be enabled to the banks. This register works in conjunction with the MEMPWDINSLEEP register. When this register is set, then the MEMPWRINSLEEP register will determine whether power is enabled to the SRAMs in deep sleep. If this register is not set, then power will always be disabled to the memory bank.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0007FFF</resetValue>
          <resetMask>0xC0007FFF</resetMask>

          <fields>
            <field>
              <name>CACHEB2</name>
              <description>Power up Cache Bank 2. This works in conjunction with Cache enable from flash_cache module. To power up cache bank 2, cache has to be enabled and this bit has to be set.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up Cache Bank 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down Cache Bank 2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEB0</name>
              <description>Power up Cache Bank 0. This works in conjunction with Cache enable from flash_cache module. To power up cache bank 0, cache has to be enabled and this bit has to be set.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up Cache Bank 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down Cache Bank 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH1</name>
              <description>Power up FLASH group 1 (1MB-2MB)</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up FLASH group 1 (1MB-2MB)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down FLASH group 1 (1MB-2MB)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH0</name>
              <description>Power up FLASH group 0 (0MB-1MB)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up FLASH group 0 (0MB-1MB)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down FLASH group 0 (0MB-1MB)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM</name>
              <description>Power up SRAM groups</description>
              <bitRange>[12:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not power ON any of the SRAM banks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Power ON only SRAM 64KB group0 (addr: 0x10010000 - 0x1001FFFF)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Power ON only SRAM 64KB group1 (addr: 0x10020000 - 0x1002FFFF)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2</name>
                  <description>Power ON only SRAM 64KB group2 (addr: 0x10030000 - 0x1003FFFF)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP3</name>
                  <description>Power ON only SRAM 64KB group3 (addr: 0x10040000 - 0x1004FFFF)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP4</name>
                  <description>Power ON only SRAM 64KB group4 (addr: 0x10050000 - 0x1005FFFF)</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP5</name>
                  <description>Power ON only SRAM 64KB group5 (addr: 0x10060000 - 0x1006FFFF)</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP6</name>
                  <description>Power ON only SRAM 64KB group6 (addr: 0x10070000 - 0x1007FFFF)</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP7</name>
                  <description>Power ON only SRAM 64KB group7 (addr: 0x10080000 - 0x1008FFFF)</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP8</name>
                  <description>Power ON only SRAM 96KB group8 (addr: 0x10090000 - 0x100A7FFF)</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP9</name>
                  <description>Power ON only SRAM 96KB group9 (addr: 0x100A8000 - 0x100BFFFF)</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM128K</name>
                  <description>Power ON only lower 128k (addr: 0x10010000 - 0x1002FFFF)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM256K</name>
                  <description>Power ON only lower 256k (addr: 0x10010000 - 0x1004FFFF)</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM512K</name>
                  <description>Power ON only lower 512k (addr: 0x10010000 - 0x1008FFFF)</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All SRAM banks (704K) powered ON (addr: 0x10010000 - 0x100BFFFF)</description>
                  <value>1023</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM</name>
              <description>Power up DTCM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable power to any DTCMs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM0</name>
                  <description>Power ON only 8KB GROUP0_DTCM0 (0 - 8KB, addr: 0x10000000 - 0x10001FFF)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM1</name>
                  <description>Power ON only 24KB GROUP0_DTCM1 (8KB - 32KB, addr: 0x10002000 - 0x10007FFF)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Power ON only DTCMs in 32KB group0 (0 - 32KB, addr: 0x10000000 - 0x10007FFF)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Power ON only DTCMs in 32KB group1 (32KB - 64KB, addr: 0x10008000 - 0x1000FFFF)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Power ON all DTCMs (0 - 64KB, addr: 0x10000000 - 0x1000FFFF)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWRSTATUS</name>
          <description>It provides the power status for all the memory banks including- caches, FLASH (0 and 1) and all the SRAM groups. The status here should reflect the enable provided by the MEMPWREN register. There may be a lag time between setting the bits in MEMPWREN register and MEMPWRSTATUS register, due to the need to cycle the power gate and isolation sequences to the memory banks.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00007FFF</resetValue>
          <resetMask>0x0001FFFF</resetMask>

          <fields>
            <field>
              <name>CACHEB2</name>
              <description>This bit is 1 if power is supplied to Cache Bank 2</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

