pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>HCPC</name>
              <description>This bit is 1 if power is supplied to HCPC domain (IO MASTER4, 5, 6)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HCPB</name>
              <description>This bit is 1 if power is supplied to HCPB domain (IO MASTER 0, 1, 2)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HCPA</name>
              <description>This bit is 1 if power is supplied to HCPA domain (IO SLAVE, UART0, UART1, SCARD)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUH</name>
              <description>This bit is 1 if power is supplied to MCUH</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUL</name>
              <description>This bit is 1 if power is supplied to MCUL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL</name>
          <description>This register provides additional fine-tune power management controls for the SRAMs and the SRAM controller. This includes enabling light sleep for the SRAM and TCM banks, and clock gating for reduced dynamic power.</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFF06</resetMask>

          <fields>
            <field>
              <name>SRAMLIGHTSLEEP</name>
              <description>Light Sleep enable for each TCM/SRAM bank. When 1, corresponding bank will be put into light sleep. For optimal power, banks should be put into light sleep while the system is active but the bank has minimal or no accesses.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Enable LIGHT SLEEP for ALL SRAMs</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables LIGHT SLEEP for ALL SRAMs</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMMASTERCLKGATE</name>
              <description>This bit is 1 when the master clock gate is enabled (top-level clock gate for entire SRAM block)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Master SRAM Clock Gate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Master SRAM Clock Gating</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMCLKGATE</name>
              <description>This bit is 1 if clock gating is allowed for individual system SRAMs</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Individual SRAM Clock Gating</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Individual SRAM Clock Gating</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSTATUS</name>
          <description>This provides the power status for various blocks within the ADC. These status comes directly from the ADC module and is captured through this interface.</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>REFBUFPWD</name>
              <description>This bit indicates that the ADC REFBUF is powered down</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REFKEEPPWD</name>
              <description>This bit indicates that the ADC REFKEEP is powered down</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VBATPWD</name>
              <description>This bit indicates that the ADC VBAT resistor divider is powered down</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VPTATPWD</name>
              <description>This bit indicates that the ADC temperature sensor input buffer is powered down</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BGTPWD</name>
              <description>This bit indicates that the ADC Band Gap is powered down</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

