pyocd/pyOCD/pyocd/debug/svd/data/apollo3p.svd
            </field>
            <field>
              <name>ALMMO</name>
              <description>Months Alarm</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALMDATE</name>
              <description>Date Alarm</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RTCCTL</name>
          <description>This is the register control for the RTC module. It sets the 12 or 24 hours mode, enables counter writes and sets the alarm repeat interval.</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>HR1224</name>
              <description>Hours Counter mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24HR</name>
                  <description>Hours in 24 hour mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12HR</name>
                  <description>Hours in 12 hour mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTOP</name>
              <description>RTC input clock control</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Allow the RTC input clock to run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop the RTC input clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPT</name>
              <description>Alarm repeat interval</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Alarm interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YEAR</name>
                  <description>Interrupt every year</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONTH</name>
                  <description>Interrupt every month</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEEK</name>
                  <description>Interrupt every week</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAY</name>
                  <description>Interrupt every day</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HR</name>
                  <description>Interrupt every hour</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Interrupt every minute</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC</name>
                  <description>Interrupt every second/10th/100th</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRTC</name>
              <description>Counter write control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Counter writes are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Counter writes are enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ALM</name>
              <description>RTC Alarm interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ALM</name>
              <description>RTC Alarm interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

